app/controllers/welcome_controller.rb

  def meow
    @messages = Message.where(receiver_id: current_user.id, read: false)
    @friend_list = []
    if FriendList.find_by(user_id: current_user.id)
      friend_list_id = FriendList.find_by(user_id: current_user.id).list
      friend_list_id.each do |id|
        @friend_list << User.find(id.to_i)
---
SELECT "messages".* FROM "messages" WHERE "messages"."receiver_id" = $1  [["receiver_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]